docs/posts/2023-06-15-gnus-email-and-microsoft365.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-21 Wed 16:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Setting up email with gnus, mbsync, dovecot, and davmail</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Setting up email with gnus, mbsync, dovecot, and davmail</h1>

<div id="outline-container-orgcbf6ac0" class="outline-2">
<h2 id="orgcbf6ac0"><span class="section-number-2">1.</span> The problem</h2>
<div class="outline-text-2" id="text-1">
<p>
My university's connect server was recently hacked, which meant that I had to leave the University's internal email system (something I had been resisting for years) for the University's preferred alternative: microsoft 365. So, now I have to reconstruct the pipeline that gets my emails from my various accounts to GNUs on my laptop.
</p>
</div>
</div>

<div id="outline-container-orgf4538aa" class="outline-2">
<h2 id="orgf4538aa"><span class="section-number-2">2.</span> The Solution</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgecb0dd3" class="outline-3">
<h3 id="orgecb0dd3"><span class="section-number-3">2.1.</span> In outline</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The solution, culled from numerous blog posts and stackoverflow and reddit posts, that I implemented was to use <a href="https://davmail.sourceforge.net/">davmail</a> to communicate with exchange, <a href="https://sourceforge.net/projects/isync/">isync</a> to give me a local copy of all my mail, <a href="https://www.dovecot.org/">dovecot</a> to act as an email server from the local stored emails that <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Gnus.html">gnus</a> can talk to to display my mails for me.
</p>
</div>
</div>

<div id="outline-container-org529bd38" class="outline-3">
<h3 id="org529bd38"><span class="section-number-3">2.2.</span> The walk-through and some details</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li><p>
Davmail
</p>

<p>
Davmail is the program that we will use to talk to the exchange account. Davmail has been around for a long time and seems to be very solid. It is also something for which I could not find a lot of novice documentation. One of the better sources for me was <a href="https://douglasrumbaugh.com/post/davmail-authentication/">Douglas Rumbaugh's post</a>. I use archlinux and getting davmail meant downling the package and installing from AUR. My properties file was in my home directory with the name <code>.davmail.properties</code>. This is the file that you edit to affect your properties and you can launch the program from the command line with <code>davmail .davmail.properties</code>. Initially, keep the server mode to false to be able to see the gui and the output from your various manipulations. Eventually you can turn the server setting to true and enable it as a systemd unit. Arch provides a file for this that you can find in <code>/usr/lib/system.d/system/davmail@.service</code>. If you look in here you will see that it expects the properties file to be in a particular subdirectory. After you get things set up you can move the file there and test with <code>sudo systemctl start davmail@britt.service</code> (replacing my name with your user name).
</p>

<p>
One of the challenges is getting things set up correctly the first time. I used the O365Manual mode to start with. That gave me a url that I posted into a browser window and provoked some authentication steps. I failed to notice that the address had changed, but after successfully authenticating the URL in the browser address bar changed. I needed to copy that and paste into the appropriate field of my davmail.properties file. Then I could just run davmail. Presumably I will have to repeat this step every several weeks.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Here for reference are some of the settings in my davmail.properties file.</label><pre class="src src-sh" id="orga98b5ac">davmail.smtpPort=1025
davmail.folderSizeLimit=0
davmail.forceActiveSyncUpdate=false
davmail.imapAutoExpunge=true
davmail.useSystemProxies=false
davmail.caldavEditNotifications=false
davmail.ssl.nosecuresmtp=false
davmail.caldavPastDelay=0
davmail.server=true
davmail.popMarkReadOnRetr=false
davmail.ssl.nosecureimap=false
davmail.disableTrayActivitySwitch=false
davmail.caldavAutoSchedule=true
davmail.enableProxy=false
davmail.mode=O365Manual
davmail.smtpSaveInSent=false
davmail.ssl.nosecurepop=false
davmail.imapPort=1143
davmail.url=https://outlook.office365.com/EWS/Exchange.asmx
davmail.sentKeepDelay=0
davmail.ssl.nosecureldap=false
davmail.imapAlwaysApproxMsgSize=false
davmail.ssl.nosecurecaldav=false
davmail.showStartupBanner=false
davmail.disableGuiNotifications=false
davmail.allowRemote=false
davmail.disableUpdateCheck=false
davmail.enableKeepAlive=true
davmail.keepDelay=30
davmail.oauth.britt@uwaterloo.ca.refreshToken={AES}Thisiswherethelongstringofyouraestokengoes
</pre>
</div>

<p>
There are many others. Note I only wanted IMAP. I did not use any of the other features that davmail can help you sync such as POP mail or your calendar and contacts.
</p></li>

<li><p>
ISync
</p>

<p>
You can let Gnus directly query your exchange server once davmail is working. When I did it it was <i>very</i> slow. This seems to be due to some weirdness around the size of individual files. Since I have something like 100K email stored that means a lot of files are checked every time. And this is even done when I all I wanted to do was refresh the in box. I decided to move copies local and then refer to them there. There are two popular tools for this: offlineimap and isync. I have used both. I started with offlineimap long ago, had some problem that I can't remember what it was and then switched to Isync. Since I have not had any problems since I never switched back. Offlineimap may now work great. I just don't know.
</p>

<p>
Isync is available from <a href="https://wiki.archlinux.org/title/Isync">Archlinux (Isync)</a>. The actual program you execute is called <code>mbsync</code> and it too requires set up that can be arcane to a new user. There are examples throughout the internet on this. My advice is to double check the dates. Some of the top hits on an internet search may point to older posts that refer to deprecated configuration terms. As a starting point here is my config which is in my home directory and that I run as from the command line. 
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>My isync configuration for three different accounts</label><pre class="src src-sh" id="org1b63689">IMAPAccount b3l
Host mail.gandi.net
User britt@b3l.xyz
Pass &lt;Ijustentermypasswordhere-youcandobetter&gt;
SSLType IMAPS

IMAPStore b3l-remote
Account b3l

MaildirStore b3l-local
Subfolders Verbatim
Path ~/.local/share/mail/b3l.xyz/britt/
Inbox ~/.local/share/mail/b3l.xyz/britt/Inbox

Channel b3l
Far :b3l-remote:
Near :b3l-local:
Patterns INBOX archives/y2023
Create Near
SyncState *
Sync All
Expunge Both


IMAPAccount proton
Host 127.0.0.1
User brittanderson@protonmail.com
PassCmd <span style="font-style: italic;">"cat ~/.protonBridgePass"</span>
Port 1144
SSLType NONE
CertificateFile /etc/ssl/certs/ca-certificates.crt
Authmechs Login

IMAPStore proton-remote
Account proton

MaildirStore proton-local
Subfolders Verbatim
Path ~/.local/share/mail/protonmail.com/brittanderson/
Inbox ~/.local/share/mail/protonmail.com/brittanderson/Inbox

Channel proton
Far :proton-remote:
Near :proton-local:
Patterns INBOX Folders/arch2023
Create Near
SyncState *
Sync All
Expunge Both

IMAPAccount university
Host localhost
Port 1143
User britt@uwaterloo.ca
Pass &lt;Againsloppysecurity-usePasscmd&gt;
SSLType None
Authmechs LOGIN
PipelineDepth 1

IMAPStore university-remote
Account university
MaxSize 40M
PathDelimiter /

MaildirStore university-local
AltMap yes
Subfolders Verbatim
Path ~/.local/share/mail/uwaterloo.ca/britt/
Inbox ~/.local/share/mail/uwaterloo.ca/britt/Inbox

Channel university
Far :university-remote:
Near :university-local:
SyncState *
Patterns  INBOX archives/y2023 
Create Near
Sync All
Expunge Both
</pre>
</div>

<p>
A few comments: Note that exchange insists on using certain imap/smtp ports. I had to manually adjust the protonmail-bridge to use different ports to avoid a conflict. Don't turn on the <b>Expunge</b> options until are sure things are working well for you. In fact you may only want to sync to the "near" part of your channel until you are confident all is functioning like you want.
</p>

<p>
An initial sync can take a <i>long</i> time. It depends on how much you are transferring. I initially set the patterns to "*" in order to get everything and have a local back up of all my emails. Then I adjusted to just refresh the folders that were going to see changes. I create a new archive each year to keep some chronological structure. I didn't seem to be getting my inbox to sync until I put the pattern in all uppercase (INBOX not Inbox or inbox).
</p></li>

<li><p>
Dovecot
</p>

<p>
You don't need dovecot. Gnus can talk directly to your maildir, but that made me feel a bit queasy. I did not want gnus messing with the actual files. I decided to run a local imap server. Dovecot is made for bigger and better things, but it can also be used for this minimal case. You have to set up the configuration and write yet another configuration file. The it too can be run as a systemd unit. A lot of the configurations for dovecot and the rest of my set up are privacy casual, but that is just for the components that run locally on my machine. I don't need dovecot to use ssl to talk to a directory on the same laptop it is running. That made it simpler for me. Again, I did a lot of cutting and pasting from internet sources and the trial and error resulted in this.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>My Dovecot Configuration</label><pre class="src src-sh" id="org21beb9a">maildir_very_dirty_syncs = yes
ssl = no
log_path = /var/log/dovecot.log
disable_plaintext_auth = no
protocols = imap
listen = *,::
auth_verbose = yes
auth_debug_passwords = yes
auth_mechanisms = plain
mail_location = maildir:~/.local/share/mail/:<span style="font-weight: bold; font-style: italic;">LAYOUT</span>=fs
passdb {
    driver = passwd-file
    args = /etc/dovecot/passwd
}
userdb {
    driver = passwd-file
    args = <span style="font-weight: bold; font-style: italic;">uid</span>=britt <span style="font-weight: bold; font-style: italic;">gid</span>=britt <span style="font-weight: bold; font-style: italic;">home</span>=/home/britt/.local/share/mail/%d/%n
    default_fields = <span style="font-weight: bold; font-style: italic;">mail</span>=maildir:/home/britt/.local/share/mail/%d/%n
}
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>Dovecot passwd file style</label><pre class="src src-sh" id="orgb97bd2d">britt@uwaterloo.ca:{PLAIN}passwd1
brittanderson@protonmail.com:{PLAIN}passwd2
britt@b3l.xyz:{PLAIN}passwd3
</pre>
</div>

<p>
Note: the <code>%d</code> and <code>%n</code> in the <code>userdb</code> refer to the domain and name from the password file. That is the reason for the very particular storage that I set up and reference in the <code>.mbsyncrc</code> file above.
</p></li>

<li><p>
Gnus
</p>

<p>
This is not the blogpost to learn how to use Gnus. I figure that any reader finding there way here is already a Gnus user and is trying to figure out how to stay that way after their University or Company forces them to use Microsoft365. That said there may be a couple of points. Since you are running dovecot you don't need multiple accounts. Gnus will find them all and create Groups for them with just a single specification of an nnimap-method.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>Specifying a gnus method</label><pre class="src src-emacs-lisp" id="org5e1f4ca">(<span style="font-weight: bold;">setq</span> gnus-secondary-select-methods
      '( (nnimap <span style="font-style: italic;">"dovecot"</span>
                 (nnimap-address <span style="font-style: italic;">"localhost"</span>)
                 (nnimap-stream shell)
                 (nnimap-shell-program <span style="font-style: italic;">"/usr/lib/dovecot/imap"</span>)
                 (nnimap-authenticator login))))
</pre>
</div>

<p>
There is lots more you can do to improve your experience, but if you get this far then you can do the tweaking without worrying too much about the preceding stages in the pipeline. Do note that you have to keep mbsync polling for new mail. You can do this with a cron job, or by setting up a key combination to invoke the shell command from inside emacs. It might be a good idea to add it to the hooks for when you start and kill gnus too.
</p></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-06-15 Thu 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-06-21 Wed 16:56</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>